let settings = {
    selector: '#container',
    name: '论文资源',
    databases: ['rice_news'],
    tables: ['rice_news_data'],
    fields: ['title', 'annotation_tag.name', 'publishTime', 'abstract', 'from', 'keyword'],
    fieldsName: ['标题', '标注', '发布时间', '摘要', '来源', '关键词'],
    rendererList: {
        'annotation_tag.name': {
            complex: true
        },
        publishTime: 'date'
    },
    detailEnable: true,
    filters: [{
        key: 'publishTime',
        label: '发布时间',
        type: 'date',
        format: 'YYYYMMDD',
        options: [{
            key: '全部',
            value: ''
        }, '2017', '2016', '2015', '2014', '2013', '2012', '2011', '2010']
    }],
    payload: {
        data: [
            {
                'publishTime': '2017-06-05',
                'from': '新疆兴农网-科技动态',
                'abstract': '全面部署推进粮食绿色高产高效创建、“互联网+”现代农业、农业经营体系升级等十大' +
                '主题示范行动工作  重点在设施农业、特种种植、水产养殖和农产品物流等领域研发成本低、精准度高、易' +
                '实施、可复制的物联网应用平台  并安排了优质小麦绿色节水高产高效试验、限水灌溉下的施氮量试验、限' +
                '水灌溉下施磷量的运筹试验、限水灌溉下氮磷配施试验、不同灌水次数条件下的密度试验、春一水不同灌溉' +
                '时间试验  与中国科学院沈阳应用生态研究所、东北地理与农业生态应用研究所、中国农业大学等单位的研' +
                '究人员进行合作  浙江省遂昌县“政企社共建”的主要成效是打造了网上政务大厅、网上技术超市、网上供' +
                '销社三大服务体系  集成组装了双季稻全程机械化配套高产栽培技术、水稻轻简化栽培高产技术、水稻“一' +
                '种两收”机械化技术、稻田综合种养高产高效技术  ',
                '_id': 'AV_jPYdBlemJ7JFf98en',
                'keyword': ['示范', '示范区', '主题', '绿色', '模式', '农业', '集成'],
                'title': '示范区十大主题行动：集成绿色模式 打造智慧农业',
                'annotation_tag': [{'name': '水稻'}]
            }, {
                'publishTime': '2017-07-28',
                'from': '新疆兴农网-科技动态',
                'abstract': '第19届国际植物学大会活动之一的“2017年国家自然科学基金委员会与国际水稻研究所联合研' +
                '讨会”  国际上很多专家都在通过研究未来气候变化、人类对水稻食用的需求等因素  如针对水稻稻瘟病、白' +
                '叶枯病等抗病性进行抗性基因改良的“分子标记辅助育种技术”  “最终目标是为农民提供品质更好、抗病抗' +
                '风险能力更强、环境更友好、产量更高的水稻品种  对涉及水稻产量、稻米外观品质、蒸煮食味品质、生态适' +
                '应性等28个优良目标基因主动设计  利用CRISPR/Cas9基因组编辑技术和高通量寡核苷酸芯片合成技术  ',
                '_id': 'AV_jPYdBlemJ7JFf98eo',
                'keyword': ['水稻', '未来'],
                'title': '“未来水稻”：你在多远的未来？',
                'annotation_tag': [{'name': '水稻'}, {'name': '白叶'}, {'name': '稻瘟病'}, {'name': '201'}, {'name': '优良'}]
            }, {
                'publishTime': '2016-10-12',
                'from': '中国农业机械化信息网-最新资讯',
                'abstract': '黑龙江省北大荒农业股份八五九分公司抓住天气晴好有利时机  陈桂芳在八五九分公司第一作' +
                '业站种植了100多亩水稻  八五九分公司超前准备、科学谋划  做到措施早制定、工作早准备、生产早动手  分' +
                '公司提倡有机户和无机户互助、大户带小户等方式推进秋收进度  八五九分公司准备收割机械１０００余台套  ',
                '_id': 'AV_jPYdElemJ7JFf98mP',
                'keyword': ['秋收', '因地制宜'],
                'title': '北大荒抗秋涝 因地制宜抢秋收',
                'annotation_tag': [{'name': '水稻'}]
            }, {
                'publishTime': '2016-10-26',
                'from': '中农网-国内动态',
                'abstract': '石垭镇 梨 子园村环绕金康肉 牛 养殖场、双旺劣种猪豢养场沼气工程  引进农业业主建起了' +
                '1500余亩紫 山药 、苕尖、 柑桔 、 西瓜 等绿色生态食物临盆基地  把沼气扶植、沼肥综合使用归入一样' +
                '平常事情议程和全县“十三五”动力扶植计划内容  县当局在工业 政策 、财务资金、农业项目等方面鼎力大' +
                '举倾斜搀扶沼气工业  县财务投入2000多万元对全县近200个畜禽养殖场沼气池扶植与使用举行嘉奖津贴  县' +
                '农业局环绕养殖场沼气工程摆设生果、蔬菜、 水稻 等特点农业工业生长  ',
                '_id': 'AV_jPYdElemJ7JFf98mR',
                'keyword': ['利用', '四川', '发展', '循环', '农业'],
                'title': '四川岳池县抓好沼肥利用大力发展循环农业',
                'annotation_tag': [{'name': '水稻'}, {'name': '四川'}]
            }, {
                'publishTime': '2016-07-15',
                'from': '中农网-国内动态',
                'abstract': '记者从自治区富硒农产物开辟办公室得悉  至今广西已有31个产物取得富硒农产物认定  广西' +
                '将富硒农业归入古代特点农业工业“10+3”晋升行为  现在曾经构成了贵港、南宁、河池、玉林、钦州等市' +
                '为中间的富硒生长典范区域  富硒农产物的品种生长到富硒 水稻 、富硒粮 油 、富硒 蔬菜 、富硒 茶叶 、富' +
                '硒生果、富硒中药材、富硒 食用菌 七年夜类            ',
                '_id': 'AV_jPYdElemJ7JFf98mT',
                'keyword': ['硒', '产品', '认证', '农产品', '广西'],
                'title': '广西31个富硒农产品获认证',
                'annotation_tag': [{'name': '水稻'}, {'name': '南宁'}]
            }, {
                'publishTime': '2016-12-14',
                'from': '中华人民共和国农业部-新闻',
                'abstract': '在万州、渝北、江津等10个区县分别开展水稻有害生物监测、设施蓝莓栽培、设施种苗生产、大' +
                '棚食用菌生产、柑橘生产监测、生猪养殖监测、山羊生产监测、水产环境控制、泥鳅水质监控等10个农业物联' +
                '网技术示范  重庆在荣昌区、梁平县、江津区、石柱县、酉阳县5个区县先后开展了农业信息进村入户整县示' +
                '范  荣昌区“在村头”益农信息社电商平台入选2016年“互联网+”现代农业百佳实践案例  重庆市还通过加' +
                '快农业大数据建设、加强农业市场监测预警和农产品品牌培育的方式  着力推进实施信息进村入户工程、稳步' +
                '推进农产品电子商务发展、着手推进农业大数据集成应用、加强农业物联网生产智能示范、加强农业市场与监' +
                '测预警工作、加强农产品品牌培育工作  农业部市场与信息司司长唐珂作了“当前农业信息化建设的形势与任务”的讲座  ',
                '_id': 'AV_jPYdElemJ7JFf98mU',
                'keyword': ['加快', '建设', '重庆', '农业'],
                'title': '重庆加快智慧农业建设步伐',
                'annotation_tag': [{'name': '水稻'}, {'name': '201'}]
            }, {
                'publishTime': '2017-07-24',
                'from': '中国农业网-农业资讯_国际动态',
                'abstract': '对农药征收18%的商品和服务税引发了农民和生产企业的共同担忧  由于农药在控制害虫、提高' +
                '产量方面是不可或缺的  印度CropLife总监Rajshekhar Sakhalkar表示  来自安拉哈巴德的一位水稻种植户' +
                'Rajkumar Pathik说他知道农药的价格很有可能会急速上涨  拉贾斯坦邦农业部长Prabhu Lal Saini上周表示' +
                '他将于中央政府交涉  我们将试图引起中央对这个问题的关注  ',
                '_id': 'AV_jPYdElemJ7JFf98mX',
                'keyword': ['农药', '印度', '税'],
                'title': '印度农药税增至18%',
                'annotation_tag': [{'name': '水稻'}]
            }, {
                'publishTime': '2016-04-18',
                'from': '安徽农网-农业科技_实用技术',
                'abstract': '　　氰氟草酯对水稻的安全性比较高  　　对直播田、移栽田、抛秧田  兑水30～40公斤茎叶' +
                '喷雾(不能采用毒土法或毒肥法施药)  土表水层应小于1厘米或排干(保持土壤水分饱和状态)  旱育秧田或旱' +
                '直播田的田间持水量饱和可使杂草生长旺盛  　　防除大龄杂草(5～7叶期)或田面干燥情况下应适当增加用药量  ',
                '_id': 'AV_jPYdElemJ7JFf98mY',
                'keyword': ['氟', '酯', '除草剂', '除草', '氰', '稻田', '高效'],
                'title': '氰氟草酯：稻田高效除草剂',
                'annotation_tag': [{'name': '水稻'}]
            }, {
                'publishTime': '2016-09-29',
                'from': '中国农业网-农业资讯_国内动态',
                'abstract': '该院作物科学研究所的多倍体水稻育种专利和论文均为世界首次发表  院士专家工作站计划' +
                '3－5年内推广多倍体水稻种植面积10万亩  　　袁隆平院士参观武汉市农科院作物研究所多倍体水稻繁育基' +
                '地  并通过一系列生物技术手段培育形成多倍体水稻新品种的育种方式  　　水稻多倍体育种是继水稻高秆' +
                '改矮秆、普通稻改杂交稻之后由二倍体改多倍体的又一次绿色革命  攻克了多倍体水稻从实验室到试验田、再' +
                '到大田种植过程中的一系列理论和技术难题  ',
                '_id': 'AV_jPYdElemJ7JFf98mc',
                'keyword': ['专家', '武汉'],
                'title': '武汉：袁隆平等院士专家在汉论“稻”',
                'annotation_tag': [{'name': '水稻'}, {'name': '多倍体'}]
            }, {
                'publishTime': '2016-08-22',
                'from': '农药工业网-行业信息_市场行情',
                'abstract': '中国农科院(CAAS)和国际水稻研究所(IRRI)签署了“中国农业科学院与国际水稻研究所水' +
                '稻基因组学和种质改良领域合作谅解备忘录”  　　CAAS和IRRI之间的合作将从以下几个方面开展合作  利' +
                '用基因组学研究促进种质改良对应对全球粮食安全挑战意义重大  本次谅解备忘录的签署进一步规范了双方' +
                '在优良品种选育、先进育种方法等方面的合作导向  促进全球水稻主产国的粮食安全IRRI所长马修&#8226  希' +
                '望同中国加强在发掘先进水稻抗性、基因组进化、提高水稻光合作用等领域的合作  ',
                '_id': 'AV_jPYdElemJ7JFf98md',
                'keyword': ['国际', '开发', '合作', '智能', '水稻', '智能型', '农科', '气候', '研究', '农科院', '中国'],
                'title': '中国农科院和国际水稻研究所签署合作备忘录,拟开发气候智能型水稻',
                'annotation_tag': [{'name': '水稻'}, {'name': '优良'}]
            }, {
                'publishTime': '2016-08-22',
                'from': '中国农业科技信息网-科技要闻',
                'abstract': '形成了渔光互补、稻虾共生、稻鱼共养、稻鸭共育、莲藕种植等多种生态种养模式  示范区已' +
                '全面建成优质稻米种植基地、苗木花卉培育基地、高效蔬菜种植基地、五华鸡饲养基地、圩猪养殖基地、水' +
                '产健康养殖基地等&ldquo  全面推广水稻直播高产栽培技术和示范推广水稻机械插秧技术等一大批先进实用' +
                '技术  盛典休闲园、同福新农业、宗春专业合作社等现代农业企业在取得良好效果的同时  如何发展现代农' +
                '业、增加农民收入、建设社会主义新农村是摆在每一个乡镇、每一个村庄的核心任务  \t\t\t\t                                           ',
                '_id': 'AV_jPYdElemJ7JFf98me',
                'keyword': ['探索', '模式', '生态农业', '生态', '种养', '结合', '芜湖', '农业', '改革', '供给', '新模式'],
                'title': '芜湖农业供给侧改革 “种养结合”探索生态农业新模式',
                'annotation_tag': [{'name': '水稻'}, {'name': '良好'}]
            }, {
                'publishTime': '2016-08-14',
                'from': '中农网-国内动态',
                'abstract': '勉县农技中间组织手艺干部门赴全县各水稻主产区  对水稻的抽穗情形再次举行了幼穗分化' +
                '历程剥检  肯定了水稻前期田管应以确保临盆宁静为目的  增进抽穗防秋封、补肥保叶防早衰、壮杆养根' +
                '防倒伏&rdquo  一是对没有破口的田块接纳干湿瓜代浇灌  三是收成前30天克制应用 农药 和激素  ',
                '_id': 'AV_jPYdElemJ7JFf98mk',
                'keyword': ['安全', '水稻', '陕西', '管', '生产', '稻田', '加强', '水稻田'],
                'title': '陕西勉县：加强水稻田管 确保生产安全',
                'annotation_tag': [{'name': '水稻'}]
            }, {
                'publishTime': '2017-04-24',
                'from': '中国农业网-农业资讯_国内动态',
                'abstract': '隆昌县水稻生产抓住冷尾暖头天气  是实现中稻和再生稻两季稳产高产的关键环节  但今年' +
                '水稻播种后的3月上、中旬全县出现了持续的低温、阴雨、寡照  栽插面积减少30个百分点左右  各级各部' +
                '门应立即组织和动员广大农户抓住近期的适宜天气及早抢晴早栽适龄秧  为确保水稻稳产高产打下基础  ',
                '_id': 'AV_jPYdElemJ7JFf98mm',
                'keyword': ['稳产高产', '四川', '稳产', '水稻', '内江', '高产'],
                'title': '四川内江：抢晴早栽适龄秧确保水稻稳产高产',
                'annotation_tag': [{'name': '水稻'}, {'name': '中稻'}, {'name': '四川'}]
            }, {
                'publishTime': '2016-12-20',
                'from': '甘肃农业信息网-科技动态',
                'abstract': '由沈阳中化农药化工研发有限公司创制、吉林省八达农药有限公司联合开发的天然源杀菌剂' +
                '——丁香菌酯获准农业部正式登记  标志着我国苹果腐烂病和水稻稻瘟病等防治领域取得重大突破  该新' +
                '品种是采用新农药创制技术“中间体衍生化方法”  该产品已获得中、美、日、欧盟等多国发明专利授权  对' +
                '“毁灭性”病害如苹果树腐烂病、水稻稻瘟病和小麦赤霉病等  而且兼具其他药剂不具备的杀虫、抗病毒活性  ',
                '_id': 'AV_jPYdElemJ7JFf98mo',
                'keyword': ['稻瘟病', '新药', '防治', '创制', '腐烂', '苹果', '酯', '有效', '瘟病', '丁香'],
                'title': '创制新药丁香菌酯有效防治苹果腐烂病、稻瘟病',
                'annotation_tag': [{'name': '水稻'}, {'name': '稻瘟病'}]
            }, {
                'publishTime': '2016-10-11',
                'from': '中国农业网-农业资讯_国内动态',
                'abstract': '　　“稻麦模式正实现了 ‘农艺’与‘农机’深度融合  小麦全程机械化模式能有效减少劳动' +
                '力投入、提升农业机械化水平  重点推广水稻集中育秧、机械插秧、小麦机条播技术和秸秆全量粉碎还田或' +
                '深翻还田技术  有效破解稻麦两熟制地区中籼稻播期早、秧龄弹性短、不利于机械插秧、稻茬田小麦耕整难、播' +
                '种难、播种质量不高等难题  过去靠单一作物、单季节、高投入、高产出的生产模式已不能适应新形势下农业' +
                '发展的需要  当前农业生产经营与服务必须向周年模式化、市场化、绿色高效可持续方向转型  ',
                '_id': 'AV_jPYdElemJ7JFf98mp',
                'keyword': ['周年', '湖北', '模式', '丰产', '湖北省', '稻'],
                'title': '湖北省主推稻麦周年丰产模式',
                'annotation_tag': [{'name': '中籼稻'}, {'name': '水稻'}]
            }],
        page: {
            pageNo: 1,
            pageSize: 15,
            totalItem: 10000
        }
    }
}

settings.loader = function (pageNo) {
    let res = service.settings
    let param = {}
    param.databases = res.databases
    param.tables = res.tables
    param.fields = res.fields
    param.query = {
        'bool': {
            'must': [{
                'bool': {
                    'should': [{'terms': {'annotation_tag.id': ['4400297527']}}],
                    'minimum_should_match': 1
                }
            }]
        }
    }
    param.pageNo = pageNo
    param.pageSize = 15
    const $container = service.select('.hiekn-table-content')
    $container.empty()
    return PdUIAjax.loader({
        url: 'http://rice.hiekn.com/rice_console/sdk/search',
        type: 'POST',
        data: param,
        success: function (data, textStatus, jqXHR) {
            const params = PdUIAjax.getSendData(this)
            if (data.data) {
                data = data.data
            }
            if (data) {
                service.setPage(data.rsCount, params.pageNo, params.pageSize)
                service.setData(data.rsData)
            } else {
                service.setPage(0, params.pageNo, params.pageSize)
            }
        },
        el: $container[0]
    })
}

const service = new PdSDKTable(settings)
